{
  "0.0.1": [
    {
      "cd7fc59e7f038b861eb38bbe0e4de980": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/35beca46843e4adcbd43df1bc93ce38b?s=200&d=mm", 
          "name": "Jessica Temporal", 
          "social": [
            {
              "email": "jessicatemporal@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nConheça o projeto Serenata de Amor, uma iniciativa de ciência de dados com código aberto e financiamento coletivo que construiu uma plataforma de inteligência artificial capaz de minerar e buscar discrepâncias na prestação de contas dos gastos de nossos deputados federais.Entenda como o projeto começou, como ele foi feito, os promissores resultados alcançados até o momento, quais são os próximos passos e como você pode nos ajudar a fiscalizar ainda mais os nossos representantes.[Ciência de Dados, Open Source, Dados Abertos]\n", 
        "title": "Serenata de Amor: Inteligência artificial usando dados abertos governamentais"
      }, 
      "37f2823caf101866db71d66d0f9f80b7": {
        "speaker": {
          "info": "Eu aplico tecnologia como alavanca pra autonomia das pessoas.", 
          "photo": "https://graph.facebook.com/v2.4/10154034810828098/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Henrique Bastos", 
          "social": [
            {
              "globe": "http://henriquebastos.net/", 
              "github": "https://github.com/henriquebastos", 
              "facebook": "https://facebook.com/henriquebastos", 
              "email": "henrique@bastos.net"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nUm conto fantástico sobre as ciladas que transforma devs em zumbis, deixando escapar por entre os dedos a janela de oportunidades do presente.Nesta apresentação você vai se imunizar contra as buzzwords para seguir a sua carreira sem sucumbir às hypes.   \n", 
        "title": "The Walking Dev"
      }, 
      "734a546d8993ecbb03fb719ae219d6ad": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/1373010302783747/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Dennys Azevedo", 
          "social": [
            {
              "email": "dennys.bd@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nComo é de conhecimento geral, Python, como ferramenta para data science, está em grande crescimento.Nessa palestra eu tentarei desmistificar alguns caminhos básicos e ferramentas para aprender e se tornar auto-suficiente no estudo de Data Science com Python.Começando em \"Por que aprender Data Science e por que Pyhton\"Passando por Ferramentas, Portais, Livros e Criadores de Conteúdos.Tentando ao fim demonstrar de forma prática como se focar a aprender por um ou mais desses meios.\n", 
        "title": "O mínimo que você precisa saber para começar em Data Science com Python"
      }, 
      "c75dc7fd5ff3d28144028744ef3e6cbb": {
        "speaker": {
          "info": "Desenvolvedor e sócio da http://www.vinta.com.br/", 
          "photo": "https://avatars3.githubusercontent.com/u/1180884?v=4", 
          "name": "Filipe Ximenes", 
          "social": [
            {
              "globe": "http://www.vinta.com.br/blog/author/filipe-ximenes.html", 
              "github": "https://github.com/filipeximenes", 
              "facebook": "https://facebook.com/filipeaximenes", 
              "email": "filipeximenes@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nPor quanto tempo é aceitável deixar o seu usuário esperando uma resposta do servidor? Para a maioria dos casos a resposta certa é: o mínimo que a conexão de internet dele permitir. Isso significa que o tempo que o seu servidor deve passar processando a requisição deve ser o mais próximo de zero possível. Nessa palestra vamos falar sobre o que são, para que servem, como  funcionam e quais são as boas práticas a se seguir quando estamos desenvolvendo tarefas assíncronas.\n", 
        "title": "(Quase) Tudo que você precisa saber sobre tarefas assíncronas"
      }, 
      "940122d090336b7d7fb0aaf2b61d85ea": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/1480558?v=4", 
          "name": "Bianca Rosa", 
          "social": [
            {
              "email": "me@biancarosa.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nA idéia dessa palestra é passar brevemente pela introdução à Redes Neurais e mostrar a implementação de uma rede neural, mostrando como utilizar Python e Scikit para criar redes supervisionadas e não-supervisionadas.Nível: IntermediárioTópicos:- Redes Neurais?   - Introdução   - Redes Supervisionadas   - Redes Não-Supervisionadas   - Aplicações- Show me the code!\n", 
        "title": "Redes Neurais com Python e Scikit"
      }, 
      "f8cb5d4c521223caefe7208bd7785f1e": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Associados", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Associação Python Brasil"
      }, 
      "c0a0300198b8456d3f22e84230c52c4c": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars2.githubusercontent.com/u/17428455?v=3", 
          "name": "Rebeca Sarai", 
          "social": [
            {
              "email": "rebecasaraiaguiar@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nTrabalhar como desenvolvedor de software pode ser um pouco frustrante, as vezes por estar preso a um projeto, as vezes por causa da linguagem que é usada, mas principalmente quando você está em um lugar que não tem nada a ver com você. Nessa palestra eu vou falar sobre a minha experiência saindo de uma grande empresa tradicional para uma empresa ágil e como essa mudança me mostrou que algumas coisas que muitas empresas negligênciam são na verdade, extremamente importantes. Coisas como testes, continuous integration, pair programming, code review, open-source, como adaptar metodologias ágeis a sua realidade, python (é claro) e django, um framework que faz o desenvolvimento de uma aplicação web parecer simples\n", 
        "title": "Previsão de séries temporais com PyData e Inteligência Artificial"
      }, 
      "dbe8c6005a376f97e1b8f4782893f5e3": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars2.githubusercontent.com/u/186126?v=3", 
          "name": "Álvaro \"Turicas\" Justen", 
          "social": [
            {
              "email": "alvarojusten@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nGênero e Número[1] é uma iniciativa independente de jornalismo com o objetivo de aprofundar o debate sobre gênero que levanta, trata e expõe dados e evidências em conteúdos de múltiplos formatos - com reportagens em texto e em vídeo, visualizações de dados interativas, ou mesmo apresentando os bancos de dados construídos ou analisados ao longo das apurações. Transparência é um valor inegociável no nosso trabalho.Toda a parte de captura, conversão e boa parte da análise de nossos dados é feita utilizando Python, baseada em dados abertos e utilizando software livre. Nesta palestra serão apresentadas as principais reportagens feitas pelo projeto e os respectivos scripts Python utilizados, nos seguintes temas: esportes, política, educação e espaço público.[1]: http://generonumero.media/\n", 
        "title": "Gênero e Número: Python ajudando nas questões de gênero brasileiras"
      }, 
      "26879625fae513566f7aefde82858018": {
        "speaker": {
          "info": "27, Brazil 🇧🇷 Based in Czech Republic 🇨🇿 Master's Degree in Computer Science 🎓 Developer at Kiwi.com ❤️ Travel, photography, technology and coding", 
          "photo": "https://lh5.googleusercontent.com/-1QIpEAR2Qe8/AAAAAAAAAAI/AAAAAAAAABM/clGha7XEWR4/photo.jpg", 
          "name": "Kátia Nakamura", 
          "social": [
            {
              "globe": "http://katianakamura.com.br/", 
              "github": "https://github.com/katiayn", 
              "facebook": "https://facebook.com/katiaynakamura", 
              "email": "katiayn@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nGeralmente, ao começarmos com Django, nos deparamos com o sistema de templates como uma maneira de gerar páginas HTML dinamicamente.Nesta palestra quero introduzir uma alternativa separando o back-end do front-end: utilizando o Django Rest Framework (DRF) com ReactJS - biblioteca javascript para construção de interfaces interativas.Vamos contruir uma pequena - e simples - aplicação para entender como DRF e ReactJS podem trabalhar juntos. \n", 
        "title": "Django Migrations: para entender e perder o medo"
      }, 
      "043344eb0f5ac7d43cdaf25a6999530f": {
        "speaker": {
          "info": "Pós - doutoranda no Departamento de Computação Aplicada - Universidade de São Paulo e Professora da Universidade Estácio de Sá. Graduada em Informática Biomédica e Fonoaudiologia e Doutorado em Ciências (Bioinformática e processamento de sinais e imagens)", 
          "photo": "https://graph.facebook.com/v2.4/904912869648916/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Paula Santos", 
          "social": [
            {
              "email": "paulac.usp@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nNessa palestra será apresentada algumas das técnicas utilizadas em processamento, analise e classificação de imagens e a implemantação. Nível: Intermediário 1. Técnicas de processamento de imagens em python 1. 1 Subtração de imagem, Gaussian, White top-hat e Black top-hat2. Análise de Imagem 2.1 Extração de vetor de característica3. Classificação usando Machine Leaning\n", 
        "title": "Análise de imagens e machine learning utilizando Python e openCV"
      }, 
      "447e812a0915900c572e580dc2d4c306": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/95cdd9a367bf07112a7f3ea0e7ebd0dc?s=200&d=mm", 
          "name": "Alice Adativa", 
          "social": [
            {
              "email": "alice.adativa@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nRedes sociais, originalmente concebidas como ferramentas de comunicação, estão sendo cada vez mais utilizadas como ferramentas inovadoras de coleta de dados para aplicações de monitoramento social e urbano. Aliando Python, ciência dos dados e redes sociais, pode-se obter uma fonte de informação útil sobre diversos aspectos do nosso cotidiano. Desta forma, aplicações interessantes vem surgindo, como estudos de comportamentos epidemiológicos, de monitoramento socioeconômico e de análise da dinâmica das cidades.Nesta palestra, vamos falar sobre como os dados provenientes de redes sociais podem ser combinados com os conceitos de ciências dos dados e as diversas ferramentas Python, de forma que possamos obter informações úteis.Categorias: Python Científico, Ciência dos Dados, Análise de Dados\n", 
        "title": "Python, ciência dos dados e redes sociais: uma combinação poderosa"
      }, 
      "e42c05e9e6d74749b7259afd411dc3a1": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/4c1463194810d6e37e73be12956f8760?s=200&d=mm", 
          "name": "Elinaldo Monteiro", 
          "social": [
            {
              "github": "https://github.com/https://github.com/elinaldosoft", 
              "facebook": "https://facebook.com/https://www.facebook.com/elinaldosoft", 
              "email": "elinaldo.java@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nNessa palestra quero falar de algumas implementações de bots em Python, dividindo em duas partes técnica e tendências.Nível: IntermediárioNa parte técnica vou falar de algumas implementações de bots para:1. Facebook2. Whatsapp3. Telegram4. Skype5. SlackNa parte de tendências, vou falar um pouco do mercado de bots e empresas que estão apoiando como:Facebook, Microsoft e IBM\n", 
        "title": "Bots (automatizando tarefas) um funcionário que não reclama"
      }, 
      "ec8d8e292e83bae1f9ce6707f5713312": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars1.githubusercontent.com/u/458654?v=3", 
          "name": "Bruno Rocha", 
          "social": [
            {
              "email": "rochacbruno@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nO ecossistema do Python é sustentado por alguns pilares que são- comunidade,  - material teórico, - ferramentas, - bibliotecas, - PSF - e a própria linguagem.Nesta palestra eu gostaria de fazer uma reflexão a respeito de cada um desses pilares do ecossistemaquais são as prioridades e em termos de qualidade quais são as vulnerabilidades de cada um deles.Mencionarei a importãncia de todos mas focarei na qualidade do ecossistema de bibliotecas, ferramentas e material teórico.A reflexão será em torno de responder algumas questões:- Como manter a qualidade das bibliotecas publicadas no PyPI?- Quais as maiores vulnerabilidades e como podemos ajudar a evitar os riscos?- A importância de material teórico de qualidade (gerado pela comunidade)- Podemos confiar em tudo que está disponivel no PyPI?- As abordagens de ensino e documentação do ecossitema são seguras, inclusivas e de fácil assimilação?- O que podemos fazer para ajudar a resolver os problemas identificados?Apresentarei alguns casos reais e exemplos de problemas encontrados e questões de segurança envolvendo principalmente o PyPI \n", 
        "title": "A Qualidade do Ecossistema Python - e o que podemos fazer para mantê-la"
      }, 
      "bc5d2bb93df49222952f396e6beded7d": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/100000286121230/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Bernardo Fontes", 
          "social": [
            {
              "email": "bernardoxhc@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nO mundo vai muito além do postgres ou mysql! Nessa apresentação, vou falar um pouco sobre o Neo4j, um banco de dados orientado a grafos, quais possíveis aplicações que podem se beneficiar do seu uso e exemplos de integração com Python utilizando as bibliotecas py2neo e networkx. Pretendo falar sobre:1 - Apresentar conceitualmente sobre grafos e sobre sua utilidade;2 - Apresentar o Neo4j com algumas operações básicas;3 - Mostrar um exemplo em Python que:- crie um grafo com vários nós;- crie relações dentro desse grafo com pesos específicos;- mostrar duas análises (menor caminho e centralidade) a partir do grafo\n", 
        "title": "Navegando por grafos com Python"
      }, 
      "9c9a0adf23c93a66890e3bfd404375f7": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars2.githubusercontent.com/u/188964?v=4", 
          "name": "Diego \"Dukão\" Guimarães", 
          "social": [
            {
              "email": "diegodukao@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nKivy é um framework multiplataforma que permite fazer aplicações em Python com interfaces inovadoras para Linux, Windows, OS X, Android e iOS. E é um dos projetos em Python mais legais que tem, só que ainda é muito pouco utilizado. O objetivo dessa palestra é apresentar o Kivy, mostrar o que é possível fazer com ele e indicar o caminho pros primeiros passos. Algumas perguntas que serão respondidas:- Funciona mesmo no celular? A performance é decente? Não fica feio?- Consigo acessar os recursos do celular?- Tem algum projeto em produção pra gente ver? O povo usa mesmo?- Exemplos! Cadê exemplos de projetos livres usando Kivy pra eu aprender?Algumas observações que não perguntam, e por isso mesmo que vou falar:- Kivy *NÃO* e só pra celular! (vc não precisa usar gtk ou qt pra botar uma interface visual no seu programa que roda no computador)- A Kv Lang (linguagem de marcação do Kivy, usada para criar as interfaces) é muito boa- Dá pra fazer jogo! \\o/\n", 
        "title": "Kivy: Python no celular e em vários outros lugares!"
      }, 
      "3fc74512b3198bf854d7e5fd7769bb5e": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/b6afc45ba08adb4f42597eee82eab137?s=200&d=mm", 
          "name": "Ryllari Santana", 
          "social": [
            {
              "github": "https://github.com/ryllari", 
              "facebook": "https://facebook.com/ryllarezita", 
              "email": "ryllarimarques@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\n[Iniciante]Todo bom programador já passou por uma fase na vida em que a POG (Programação Orientada a Gambiarra) foi sua melhor amiga. Junto com ela (ou até mesmo sem ela!), encontram-se erros comuns e alguns erros absurdos que são cometidos com frequência e que, na maioria das vezes passam despercebidos até mesmo por programadores experientes. Nesta palestra, irei mostrar algumas dicas do que não fazer quando estiver programando em Python, utilizando como exemplos alguns códigos e erros que programadores (do Padawan ao Mestre Yoda) cometem sem nem sentir o peso.13(-10) reasons why você precisa assistir esta palestra:1. \"O inteligente aprende com os seus erros, o sábio aprende com os erros dos outros.\"2. Conhecer os erros ajuda a evitá-los.3. Python é bom demais pra ser codado errado.\n", 
        "title": "Como NÃO programar em Python: crimes dolosos e com agravante"
      }, 
      "2a7cbba54ac640e3a8686ef496c3211f": {
        "speaker": {
          "info": "Eterno estudante de ciência da computação sou um dos responsáveis pelo PyCursos e Python para Zumbis (MOOC de ensino de Python com mais de 30 mill inscrições). Tenho interesse em: Desenvolvimento de Software, Python, Análise de Dados, Inteligência Artificial, Engenharia de Avaliações, Design e Minimalismo.Interesses em: Desenvolvimento de Software, Python, Análise de Dados, Inteligência Artificial, Engenharia de Avaliações, Design e Minimalismo.", 
          "photo": "https://avatars0.githubusercontent.com/u/223948?v=3", 
          "name": "Gileno Filho", 
          "social": [
            {
              "globe": "http://www.gilenofilho.com.br/", 
              "github": "https://github.com/gileno", 
              "facebook": "https://facebook.com/gilenofilho", 
              "email": "contato@gilenofilho.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nJá tentou acessar uma página através de um script Python e teve problemas porque a página usava algum framework javascript como Angular, React...?Nessa palestra vou mostrar como criar um web crawler que consiga acessar essas páginas dinâmicas simulando um navegador com Scrapy e Selenium.\n", 
        "title": "Criando Web Crawlers com Scrapy e Selenium para páginas com Javascript"
      }, 
      "b8011bdfc12b2db32fb504ceeca5f804": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/2050141818543450/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Ana Paula Mendes", 
          "social": [
            {
              "email": "anapaula.ds.mendes@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nQuem nunca teve medo de começar?Nesta talk contarei para você sobre como tem sido a experiência com Python durante 1 ano de aprendizado e como foi começar a aprender Python para ensinar para outras meninas na primeira iniciativa feminina de tecnologia do Piauí.\"Os navios estão a salvo nos portos, mas não foi para ficar ancorados que eles foram criados.\" (Grace Hopper)[Iniciante, Comunidade]\n", 
        "title": "Começando com Python - Aprendendo para ensinar, a melhor forma de programar!"
      }, 
      "60cb7c4c3ebbfd116725f670ab3468cf": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/2891076?v=3", 
          "name": "Matheus Souza Fernandes", 
          "social": [
            {
              "email": "matheus.souza.fernandes@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nO portal e-Democracia é uma iniciativa da Câmara dos Deputados que visa ampliar a participação social no processo legislativo e aproximar cidadãos e seus representantes por meio da interação digital desenvolvido pelo Laboratório Hacker da Câmara dos Deputados.Nessa palestra serão abordados os seguintes tópicos:- O que é o e-Democracia?- As ferramentas que compõe a plataforma    - Wikilegis: plataforma para sugestão de emendas aos textos legislativos (Python/Django)    - Audiencias Interativas: plataforma de interação em audiencias/eventos públicos da Câmara dos Deputados (Python/Django)    - Discourse: fórum de discussões aberto para a sociedade (Ruby on Rails)- Como juntar todas essas aplicações?- Dificuldades que encontramos\n", 
        "title": "Usando Python e Django para ampliar a democracia digital"
      }, 
      "70044d48557c0b204f3891bae6ef109f": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/82f4345815443a1b1f6edfe474e6a0a0?s=200&d=mm", 
          "name": "Ole Peter Smith", 
          "social": [
            {
              "email": "ole.ufg@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nDizem que uma imagem diz mais do que mil palavras. Então, uma animação deve dizer mais do que mil elevado a tantos... Infelizmente a Matemática tem uma fama de além de ser chato, ser deficil. Agredita-se um fator decisiva ser o tradicional foco algébrico, acima do geométrico, no ensino desta disciplina, desde o ensino fundamental ate o nível universitário. Isto em todas as áreas, inclusive nas áreas mais ligadas à matemática, como informática.Proponhe-se nesta palestra, usar a Geometria como um ponte de encontro entre calculos algébricos e computacionais (em Python) - e sua visualização/animação. Escolhemos implementar os cálculos em Python, primordialmente pela sutilidade desta linguagem possibilitar sobrecarregar operações u/binárias (como +, -, *,== e print, to name a few...), possibilitando expressões como u=v+w e v=w*3 (mas não 3*w...) entre vetores e até matrices. Para geração de imagens escolhemos SVG, por ser um formato textual, livre e escalável, permitindo a visualização de detalhes. Animamos seqüências de SVGs geradas, usando o Carousel (do W3 Schools).Introduziremos conceitos básicos da Gemetria Diferencial - Velocidade, acceleração, comprimento arco e curvatura - através da exposição de código específico (Python) e animações Carousel/SVG. Particularmente, expormos como visualização dinâmica pode inspirar e coroborar um processo investigativo científico: uma visualização gerada computacionalmente, inspira um hipótese - e desenvolvendo mais as computações, providencia-se um meio para sua verificação.As Curvas da Bosta, são curvas geradas por um ponto marcado numa circumferência, rolando, sem deslizar, em uma outra curva. Esta outra curva sendo uma reta (o eixo X), resulta em uma curva chamada Cicloid. Fazendo o mesmo no lado de fora, respectivamente lado de dentro, uma circumferência (fixa), as curvas geradas são Epicicloids, respectivamente Hipocicloids.A evoluta de uma curva, é a curva traçada pelos seus centros de curvatura. Calculando numéricamente a evoluta de um Cicloid, levanta-se o suspeito, que sua evoluta é novamente uma evoluta. Verificamos, primeiro visualmente - depois matemáticamente - a hipotese.\n", 
        "title": "Geometria Computacional de Diferencial com Python e SVG: As Curvas da Bosta"
      }, 
      "015e99114be9088abe88ebf11cc798b0": {
        "speaker": {
          "info": "Graduado em Engenharia de Software pela Universidade de Brasília, atuando como Analista de Infraestrutura na 4linux.", 
          "photo": "https://graph.facebook.com/v2.4/1705767706106989/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Tiago Assunção", 
          "social": [
            {
              "github": "https://github.com/TiagoAssuncao", 
              "facebook": "https://facebook.com/tiago.ribeiro.351104", 
              "email": "tiagoribeirodeassuncao@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nNesta palestra será apresentada a solução implementada para centralizar, automatizar e permitir que qualquer máquina embarcada do case de um dos maiores Bancos do País seja acessada remotamente para tarefas de gerenciamento e manutenção.As manutenções são orquestradas pelo Fabric, paralelizando e agendando tarefas com o Celery e todo o sistema é mantido por um dashboard em Flask.Palavras Chave: Fabric, Celery, Flask, Embarcados.\n", 
        "title": "Python na Manutenção de mais de 100 mil embarcados"
      }, 
      "b64f238d51fe542b20c85a0a8137a8d8": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars1.githubusercontent.com/u/805582?v=4", 
          "name": "Celso Crivelaro", 
          "social": [
            {
              "email": "celsocrivelaro@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nAPis conectam app a apps dando escalabildiade para produtos e negócios. Um bom projeto de API deixa sua aplicação segura, estável e escalável, deixando o negócio estável para internet ou mesmo internamente.Nesta talk, irei falar sobre o que levar em consideração quando se projeta uma API, as diferenças de arquitetura para o backend que provê uma API Pública, Microserviços ou SPA e como manter o seu serviço principal estável mesmo com uma API externa com grande volume de requisições.Também falarei de como projetar o seu schema para mudanças futuras, como escolher o tipo de schema (XML ou JSON), problemas de versionamento da API, autenticação e REST ou SOAP.  Com esta talk você estará mais apto a tomar boas decisões na arquitetura da sua API.\n", 
        "title": "Projetos de APIs: O que pensar para APIs Públicas, Microsserviços e SPAs"
      }, 
      "ec70d2ed087997b65faf2235d224f8e1": {
        "speaker": {
          "info": "", 
          "photo": "https://lh4.googleusercontent.com/-JTYOOwJIr0A/AAAAAAAAAAI/AAAAAAAAHEQ/vWMkwztjsKw/photo.jpg", 
          "name": "Douglas Bastos", 
          "social": [
            {
              "globe": "http://www.github.com/douglasbastos", 
              "github": "https://github.com/douglasbastos", 
              "facebook": "https://facebook.com/douglasbastosok", 
              "email": "douglashsb@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nTestar unitariamente é fácil, mas quando temos uma dependência externa no nosso código, a implementação do teste acaba demorando quando não sabemos usar direito os \"paranauês\" do mock.Nível: inicianteNessa palestra vou mostrar na prática as diversas maneiras de mockar objetos e isolar seu código testável de dependência externas como APIs e bancos de dados.Falarei brevemente de teste unitário, qualidade de código até me aprofundar sobre mocks no python.\n", 
        "title": "Descomplicando os mocks"
      }, 
      "dadc617c57af1a49e75dadcf3d639879": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars3.githubusercontent.com/u/6271498?v=3", 
          "name": "Diogo Martins", 
          "social": [
            {
              "globe": "http://www.diogommartins.com/", 
              "email": "magalhaesmartins@icloud.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nNivel: IntermediárioLocks? GIL? Multitasking? Corrotinas? Tulip ? async?  await?  event loop? Se tudo isso não faz sentido pra você, o objetivo dessa palestra é mudar isso, dando desde uma explicação sobre concorrência e paralelismo até o estado atual da comunidade, do ferramental, dos benefícios e onde AsyncIO se encaixa.Versão palestra, com mais conteúdo sobre AsyncIO, desse post em duas partes: https://diogommartins.wordpress.com/2017/04/07/concorrencia-e-paralelismo-threads-multiplos-processos-e-asyncio-parte-1/  \n", 
        "title": "Concorrência e Paralelismo - Threads, Múltiplos processos e ASYNCIO"
      }, 
      "b898d13c45797e21889bcbe5726174b4": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/155623?v=3", 
          "name": "Alan Justino", 
          "social": [
            {
              "globe": "http://www.apiregistro.com.br/", 
              "github": "https://github.com/alanjds", 
              "email": "alan.justino@yahoo.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nGrumpy é um \"transpiler\" de Python para Golang, uma maneira de usar a velocidade, concorrência e paralelismo de Go escrevendo com a produtividade do código Python. Está sendo desenvolvido no Google pelas pessoas ligadas ao Youtube como alternativa a reescrever manualmente grande quantidade de código Python existente.CPython oferece concorrência assíncrona via coroutines, gevent e async (PEP 492, à partir de CPython 3.5). Isso funciona muito bem para códigos I/O-Bound, como acesso à rede e ao disco. Mas não consegue usar mais de 1 processador em sua aplicação CPU-Bound, como moedores de números. Não consegue porque só tem 1 thread no Sistema Operacional, mesmo com várias coroutines na fila e vários processadores ociosos. E mesmo se você abrir várias threads, só 1 vai usar CPU ao mesmo tempo, devido ao famigerado GIL (Global Interpreter Lock).Golang é uma linguagem feita para atender demandas de alta concorrência. Não tem GIL e automaticamente aloca as Goroutines nos processadores disponíveis, usando bem mais do hardware disponível.Grumpy \"traduz\" seu código Python para ser compilado em Go. Isso funciona muito bem mas introduz certos desafios, como incompatibilidade com a C-API do CPython e ausência das chamadas exec, eval e compile, por exemplo.Será apresentado em 3 partes, com comparativos, exemplos e demonstrações:* Concorrência e Paralelismo no CPython e Go Runtime* Grumpy Transpiler como alternativa ao CPython Runtime* Internals e desafios do runtime Grumpy \n", 
        "title": "Python Runtime sem GIL em Golang: Grumpy"
      }, 
      "2f5c7962393708eafc16c236d7db5599": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Rodolpho Eckhardt", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "3854c5e3252639a555fccc02125989cf": {
        "speaker": {
          "info": "Production Engineer @ Facebook", 
          "photo": "https://graph.facebook.com/v2.4/1418848041536021/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Carla Souza", 
          "social": [
            {
              "globe": "http://carlasouza.com/", 
              "github": "https://github.com/carlasouza", 
              "facebook": "https://facebook.com/carlasouzaa", 
              "email": "carla.asouza@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nA Interface de Linha de Comando (CLI) é uma das interfaces de usuário mais flexível e poderosa. CLIs são as interfaces que eu mais utilizo trabalhando como Production Engineer para Facebook.Ter comandos bem estruturados, legíveis, não ambíguos e a prova de erro humano são características indispensáveis para que a CLI seja segura e fácil de usar.Nessa palestra, eu irei introduzir boas práticas utilizadas por linhas de comandos e como estruturar uma Interface de Linha de Comando do zero, ilustrando com exemplos de erros e acertos.   \n", 
        "title": "Linha de Comando: como ser bem implementada e segura"
      }, 
      "99e4c6dd49599cec8f546965a705ee0f": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Andrew Godwin", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "a80e222d0d1004ba456103a424a7b26d": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/865201390216236/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Paula Grangeiro", 
          "social": [
            {
              "email": "animegirl.pchan@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nQuantas vezes você já ouviu (ou mesmo disse) que \"Desenvolver testes são uma perda de tempo?\". Nesta talk iremos demostrar porque você deve incluir os testes no seu ciclo de desenvolvimento e o real ganho disso para o projeto.Nível: InicianteO que iremos abordar?- Breve definição sobre testes unitários e como fazer em Python- Melhorando a qualidade de código utilizando testes       - O que é TDD       - Como iniciar em TDD- Automatizando deploy com a ajuda de testes       - O que é Integração contínua       - Automatizando rotinas de deploy- Outras vantagens da adoção de testes       - Testes como documentação do projeto- Conclusão\n", 
        "title": "Agilizando o ciclo de desenvolvimento de software com a ajuda de testes unitários"
      }, 
      "7bcfa5c3f07b6083055252b3f01d3fdd": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars2.githubusercontent.com/u/613912?v=4", 
          "name": "Renato Oliveira", 
          "social": [
            {
              "globe": "http://www.labcodes.com.br/", 
              "github": "https://github.com/renatooliveira", 
              "facebook": "https://facebook.com/renatosoliveira", 
              "email": "renato+github@labcodes.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nSoftware é um organismo vivo. Ele nasce, cresce e algumas vezes, adoece. Trabalhar com código legado é uma experiência que todo programador já passou ou irá passar em sua carreira. É muito comum encontrar código repetido, que você não sabe se funciona ou até se está sendo usado. Nesta palestra vou dar algumas dicas de como melhorar a saúde da sua base de código e falar de algumas técnicas de refatoração.\n", 
        "title": "Trabalhando com código legado"
      }, 
      "eab7c0dc175a679243e0eb81daf634bd": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Comunidade PythonMG", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Encerramento"
      }, 
      "32eecceefb5cf14cb40222221cd95ffa": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/7e3eb83614b34d91d1587eaab44bcf5d?s=200&d=mm", 
          "name": "Laura Panzariello", 
          "social": [
            {
              "github": "https://github.com/laurapanzariello", 
              "facebook": "https://facebook.com/laurapanzariello", 
              "email": "laura.panzariello@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nCategoria: Infra, Automatização, DevOpsNível: InicianteA ideia é apresentar a arquitetura Spine and Leaf utilizada com Fabric L3 ECMP, uma arquitetura projetada para garantir a escalabilidade, rapidez e eficiência do tráfego do data center da Globo.com. Além disso, apresentar o desenvolvimento da ferramenta para provisionamento automatizado das redes e seus equipamentos escrita em Python.* Conceito e vantagens da arquitetura Spine and Leaf * Conceito e vantagens de Pod no Data Center* Provisionamento automatizado utilizando uma ferramenta desenvolvida utilizando Python e Django. \n", 
        "title": "Provisionamento de redes no data center Globo.com com Python"
      }, 
      "233ce75f1dbec25a7319ef4a003aa099": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/3246075?v=4", 
          "name": "Nicolle Cysneiros", 
          "social": [
            {
              "email": "nicolle.cysneiros@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nVocê passa horas definindo sua API REST seguindo as boas práticas de definição e acesso a recursos, para no final das contas acabar criando endpoints a mais, afim de não prejudicar a performance da sua aplicação? Por mais que você procure definir uma sintaxe universal para definir os recursos da sua API REST, você acaba tendo algumas views da sua aplicação que precisa realizar mais de uma requisição para que possa exibir todos os dados necessários? Esses talvez sejam alguns sinais de que sua API não necessariamente precise seguir os princípios REST.Para resolver esse problema, o Facebook criou o GraphQL: uma linguagem de consulta para APIs. O GraphQL permite a criação de um único endpoint “inteligente”, capaz de responder perguntas complexas, ao invés de um conjunto de endpoints mais simples como proposto pela arquitetura REST. Nessa palestra, irei apresentar em mais detalhes sobre essa linguagem e estabelecer uma comparação com sistemas que utilizam a abordagem REST. Também irei falar sobre os principais componentes do GraphQL API e mostrar como podemos construir e consumir uma API usando GraphQL e Python.Outline:IntroduçãoFrustrações de um desenvolvedor full-stackO que é GraphQL?Evolução e Adoção de GraphQLGraphQL vs RESTExemploVantagens e DesvantagensComponentesQuerySchemaResolversGraphQL + Python = GrapheneExemploGraphene Django\n", 
        "title": "GraphQL: nem sempre REST é a melhor alternativa para sua API"
      }, 
      "55a898578181414c4ac83afe8ef8b41f": {
        "speaker": {
          "info": "", 
          "photo": "https://lh6.googleusercontent.com/-q-D1R6lcFnU/AAAAAAAAAAI/AAAAAAAAA1U/UJu8Vin1e-c/photo.jpg", 
          "name": "Lais Varejão", 
          "social": [
            {
              "email": "laisvarejao@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nDesenvolvedores sabem: não existe software livre de bugs. Crises são iminentes. Como mitigar, então, seu potencial danoso? Como gerenciar, por exemplo, um bug que afeta metade dos usuários de um sistema? Nesta talk eu irei compartilhar, entre outros casos, minha experiência gerenciando crises de um sistema de assinaturas sediado em NY. Iremos ver diferentes cases, possíveis fragilidades de código que podem levar a bugs graves e o passo a passo de processos de gestão de crises. Finalmente, veremos como lidar com a expectativa do cliente, desde a descoberta do bug até a recuperação dos dados afetados.\n", 
        "title": "Salvando grandes projetos"
      }, 
      "6fa11bc8799e3caca3e432ba23c7792b": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/bd7dbe61d56c5e3bad64f6b77f462984?s=200&d=mm", 
          "name": "Darlene Medeiros", 
          "social": [
            {
              "email": "darlenedms3@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nSempre que iniciamos um novo projeto queremos que ele seja perfeito, o código tem que ser bem escrito, com alta coesão, baixo acoplamento, SOLID, KISS, DRY, YAGNI, testes automatizados e padrões de código, mas um ponto que nem sempre refletimos é sobre a estrutura da aplicação.Meu objetivo nessa palestra é apresentar alguns padrões arquiteturais (MVC, event-driven, microservices e pipe and filter) em Python, utilizando exemplos de frameworks como Django, Flask e Tornado, e te ajudar a entender como eles funcionam.\n", 
        "title": "Padrões Arquiteturais, muito além do MVC"
      }, 
      "9df85297eee71d86d59906978396e29a": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/fe8d19d6ad15194b518f594984b3a458?s=200&d=mm", 
          "name": "Pyladies Brasil", 
          "social": [
            {
              "globe": "http://brasil.pyladies.com/", 
              "github": "https://github.com/pyladies-brazil", 
              "facebook": "https://facebook.com/PyLadiesBrazil", 
              "email": "brazil@pyladies.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\n2017 foi o ano em que ocorreram mais Django Girls no Brasil. Em sua maioria, as organizadoradoras dos workshops também fazem parte das PyLadies.Venha conhecer um panorama de como foi o trabalho desse ano de trazer mais mulheres pro mundo da tecnologia.\n", 
        "title": "PyLadies e Django Girls promovendo a diversidade na tecnologia"
      }, 
      "953e4fdb73dfca1a6433944e2dcf7060": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Carlos Henrique Coêlho", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Python e tipagem estática"
      }, 
      "c9074f92a8ccf8f2f3e9c7d021c47012": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Associados", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Associação Python Brasil"
      }, 
      "a445192937e1313ebebc01355284816e": {
        "speaker": {
          "info": "", 
          "photo": "https://lh5.googleusercontent.com/-AQB28vqL2bQ/AAAAAAAAAAI/AAAAAAAACqU/1XxemlUFxRs/photo.jpg", 
          "name": "Thomaz Reis", 
          "social": [
            {
              "email": "thomaz.reis@corp.globo.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nEntenda o que signfica os \"yield\" que você encontra no código e para o que eles servem. Também entenda como isso permitiu a programação assincrona com corotinas. Vamos abordar também como o Assync / Await do Python 3.5 deixou tudo ainda melhor e mais claro.Nível: Intermediário / Avançado\n", 
        "title": "Generators e Programação Assincrona com Python"
      }, 
      "64799727277226358160760e8c6eed5b": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Comunidade PythonMG", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Abertura"
      }, 
      "d603942f73c4c9dccbf0957f74756245": {
        "speaker": {
          "info": "Mestre em Ciência da computação na área de Redes e sistemas distribuídos pela UFMG. Engenheiro de software sênior na Globo.com.", 
          "photo": "https://avatars2.githubusercontent.com/u/759784?v=3", 
          "name": "Gustavo Pantuza", 
          "social": [
            {
              "globe": "https://blog.pantuza.com/", 
              "github": "https://github.com/pantuza", 
              "facebook": "https://facebook.com/pantuza", 
              "email": "gustavopantuza@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nEntenda como bibliotecas Python como PIL, ScyPy, Numpy fazem interface com módulos em C compilados disponível no sistema operacional. Nativamente o Python te permite fazer isso. Essa palestra visa apresentar os conceitos, os recursos do compilador/interpretador Python para permitir essa tipo de interação entre as linguagens. Um módulo C / Python será apresentado como exemplo.\n", 
        "title": "Wrapping C libraries into Python interfaces"
      }, 
      "b7adfd7dc82db7e93011bd536473f1f2": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/800133810122133/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Talita Rossari", 
          "social": [
            {
              "email": "rossaritalita@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nVou falar sobre o meu relacionamento com o Flask depois de anos em uma paixão adolescente com o Django.Nível: IntermediárioNesta Talk você vai ver:- Uma MINI comparação entre os dois (Para mostrar a diferença)- Cada etapa deste novo relacionamento- O que eu aprendi com esse relacionamento- O que eu mais gostei no Flask- O que eu mais senti falta- O que eu não senti falta- Na minha humilde opinião, quando usar Django ou Flask?Trilhas: Framework; Web; CarreiraPS: Esta palestra não tem como intuito discutir qual Framework é melhor (Até porque, viraria uma terceira guerra mundial).\n", 
        "title": "O Flask roubou meu coração"
      }, 
      "1080811cc2da1435c56a33e732eb546a": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/4183188?v=4", 
          "name": "Hélio de Meira Lins", 
          "social": [
            {
              "github": "https://github.com/meiralins", 
              "email": "helio@meiralins.org"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nAs runas do mapa de Thrór guiam a turma do livro \"O Hobbit\" em uma aventura para retomar a Montanha Solitária. Decifrar as runas e descobrir um caminho de entrada para Erebor é um dos primeiros desafios nessa jornada. Nessa palestra, vamos definir o problema de traduzir as runas, analisar possíveis estratégias de solução e finalmente usar livros do maior romancista do brasil para \"aprender português\" e resolver o problema. Nível: InicianteCategorias: Inteligência Artificial, Otimização\n", 
        "title": "Decifrando as Runas dos Anões com Python e Machado de Assis"
      }, 
      "fc697c3b101435fa2e268ff0be5ecd0d": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Allison Kaptur", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "d0887d3dae98647858f2558b8e50e318": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Manuel Kaufmann", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "4d26003c95c16d131c6a12e43f9d6348": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/10154587453977411/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Navid Sheikhol", 
          "social": [
            {
              "email": "navid@navid.it"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nFBJE is a framework used at Facebook for developing workflows in Python.It is extremely scalable as it uses a distributed scheduler to leverage multiple worker nodes. As workers join and leave the execution pool due to hardware volatility, running jobs automatically migrate to active nodes while persisting their contextual data. Logs from each individual job are forwarded and stored centrally for users to access directly, searched or aggregated in various ways.Its ability of running long lasting jobs, easily access to logs and creating jobs using an API has made FBJE very popular for implementing a variety of automation workflows ranging from hardware provisioning, software deployment and alarms auto-remediation.\n", 
        "title": "Facebook Job Engine (FBJE): a framework for developing\n        scalable workflows in Python"
      }, 
      "89f891b9aa0241fbbf49adf71ea90bd8": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Paola Katherine", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "f463fa3b601f977add97281325d5a776": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/459390?v=4", 
          "name": "Rael Max", 
          "social": [
            {
              "email": "contato@raelmax.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nO \"Core\" é o CMS criado em 2009 com a missão de ser a base para a construção de todos os portais da Globo.com. 8 anos se passaram, a internet mudou, os desafios mudaram e é hora de aposentar esse soldado em grande estilo.Nessa talk falarei sobre como tem sido esse processo de aposentadoria, os desafios da migração dessa aplicação Django para uma nova arquitetura baseada em microserviços e como estamos fazendo isso com o menor impacto possível para os usuários e para os editores dos portais.\n", 
        "title": "O fim de uma era: os desafios de transformar um monolito de 8 anos em microserviços"
      }, 
      "8a72bf94425bf29c87184275ad9f6b19": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/1439665433025298/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Anderson Resende", 
          "social": [
            {
              "email": "andersonresende86@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nSe você já usou lambda, maps ou comprehensions em Python, você já esta usando aspectos da programação funcional. Vamos explicar de forma simples o que é programação funcional, quais são as construções funcionais existentes em Python e como podemos usá-las para melhorar nosso código e prevenir bugs. Vamos  também descomplicar conceitos como Side Effects, imutabilidade, código declarativo, e expressions.Tópicos a serem abordados:1) Introdução a programação Funcional:- Paradigma Funcional X Imperativo- Mutação X Imutabilidade- Expressions X Statments- First-Class and High-Order functions2) Construções Funcionias em Python:- Lambda- Map, Filter, Reduce- Compreehensions- Partial, Comp, Operators3) Modulos:- Functools- Itertools\n", 
        "title": "A Programação Funcional em Python, de forma simples"
      }, 
      "fa11560c816e80cdbd65db58ca36d120": {
        "speaker": {
          "info": "I’m Artur Rodrigues, and I’m a Production Engineer at Facebook taking care of its MySQL Infrastructure from London, United Kingdom.\nBefore joining FB, I worked as a Software Engineer at IDXP Analytics where I captured probe requests on OpenWRT powered routers, built big data algorithms using scientific packages in Python, developed RESTful APIs with Rails and PostgreSQL and handled all of the DevOps efforts involved in collecting millions of data points every week.", 
          "photo": "https://avatars4.githubusercontent.com/u/119276?v=4", 
          "name": "Artur Rodrigues", 
          "social": [
            {
              "globe": "http://www.artur-rodrigues.com/", 
              "github": "https://github.com/arturhoo", 
              "facebook": "https://facebook.com/arturhoo", 
              "email": "arturhoo@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nUma equipe de apenas 14 engenheiros cuida da infraestrutura do principal banco de dados do Facebook, suportando quase 1.9 bilhões de usuários/mês. Toda ação no Instagram, Messenger, WhatsApp e claro, no FB, passa direta ou indiretamente pela infra de dezenas de milhares de servidores que rodam MySQL. A linguagem usada pela equipe e por trás de toda a automação é Python. Nessa palestra, vamos mostrar como a linguagem possibilitou que chegássemos nessa escala, passando pela evolução, desafios e futuro: - Interfaces “tipadas” com Thrift;- Empacotamento através do Buck;- Type Checking com MyPy;- Asyncio para novos serviços;- Debugging com gdb 7 e pudb; Durante a palestra, também passaremos por algumas decisões de DevOps que podem inspirar novas soluções: gerenciamento de uma frota massiva de servidores, multitenancy e sharding, backups e restores contínuos, schema migrations, entre outros. [DevOps] \n", 
        "title": "Python na Infraestrutura MySQL do Facebook"
      }, 
      "0bad437e9b18a27d70e9bdd8e87b81b3": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/2156035871289568/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Daniela Petruzalek", 
          "social": [
            {
              "email": "daniela.petruzalek@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nUma introdução ao mundo de Big Data com Apache Spark contextualizada dentro do ambiente da Globo.com. Aborda desde a definição de Big Data, a mudança de paradigma de programação para viabilizar a computação paralela, os diferenciais tecnológicos do Spark e as suas aplicações práticas na Globo.com. Finalizamos com uma breve demo do pyspark shell.\n", 
        "title": "Big Data com Apache Spark na Globo.com"
      }, 
      "7eda19763c8643e6f98dfef205742b8a": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars.githubusercontent.com/u/5848493?v=3", 
          "name": "Débora Correia", 
          "social": [
            {
              "email": "debora@labcodes.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nDesign não foi uma parte inicial da revolução da web. Basta lembrar das primeiras versões do Google ou Yahoo para perceber que, quando os primeiros softwares surgiram, a única preocupação era com o código, enquanto usabilidade e estética seriam questões ainda muito futuras. O importante era ter um website, e não um que garantisse uma boa experiência pro usuário.Com o surgimento de novas empresas e aumento de concorrentes, a qualidade dos produtos aumentou drasticamente e hoje design realmente importa tanto quanto a tecnologia. Ainda assim, apesar de designers e devs viverem em overlapping worlds, suas atividades são muito distintas. Compartilhar habilidades e aprender a falar a língua do outro é essencial para comunicar ideias.  O que então você, como desenvolvedor, deve aprender para facilitar na comunicação com o designer no seu time, ou o que fazer quando ele não está disponível (ou nem mesmo existe)? Esta palestra tem como objetivo aumentar a sua consciência de design. Isto significa entender inicialmente o que é um \"bom design\", discutir como o processo de criação pode ser incorporado no desenvolvimento de software, além de mostrar como é possível, através da aplicação de alguns conceitos simples, melhorar a experiência das interfaces desenvolvidas.\n", 
        "title": "O que desenvolvedores deveriam aprender sobre design?"
      }, 
      "9e29d46812331b2cd79b78b67a71ea31": {
        "speaker": {
          "info": "Osvaldo Santana Neto é CTO/Desenvolvedor na Olist, facilitadora e aceleradora de vendas em marketplaces, membro-fundador e ex-presidente da Associação Python Brasil. Também é membro da Python Software Foundation e co-autor do livro Python e Django. Teve passagens por empresas como Conectiva (Mandriva) e Instituto Nokia de Tecnologia onde deu início ao projeto de porte do Python para a plataforma Maemo (MeeGo).", 
          "photo": "https://www.gravatar.com/avatar/9274b1eafb37f921c2db2ca6ecfc6f04?s=200&d=mm", 
          "name": "Osvaldo Santana", 
          "social": [
            {
              "globe": "https://osantana.me/", 
              "github": "https://github.com/osantana", 
              "facebook": "https://facebook.com/osantanabr", 
              "email": "speakerfight@osantana.me"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nNessa apresentação eu demonstro com detalhes como a arquitetura da Olist foi implementada usando microserviços distribuídos que se comunicam através de um sistema de mensageria baseado no pattern Publisher/Subscribers (PubSub).A plataforma Olist usa Python 3.6, Django, Django REST Framework, Loafer (asyncio), AWS SNS/SQS e PostgreSQL. Fazemos deployment no Heroku e desenvolvemos tudo isso com uma equipe distribuída por quase todas as regiões do Brasil (ainda falta um representante do Norte!).Essa palestra foi apresentada durante a Caipyras 2017 e os slides estão disponíveis no endereço: https://www.slideshare.net/osantana/plataforma-distribuda-de-microservios-ou-como-a-olist-funciona\n", 
        "title": "Plataforma distribuída de Microserviços ou, como a Olist funciona"
      }, 
      "abe785eff9244ac1c586b557d93821d8": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Associados", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Associação Python Brasil"
      }, 
      "151b0e85169af41667aec218307302ce": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars3.githubusercontent.com/u/2574306?v=3", 
          "name": "Julio Melanda", 
          "social": [
            {
              "email": "jcemelanda@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nEm novembro de 2015 comecei com a Toptal e desde então tenho trabalhado como desenvolvedor Freelancer remoto.Nesta palestra pretendo falar um pouco dos vários desafios que envolvem este tipo de trabalho, desde as necessidades técnicas até as questões financeiras de como receber e tudo mais. Além dos desafios, quer mostrar as várias vantagens que encontrei neste modelo de trabalho nestes 2 anos.Nível: inicianteCategoria: Carreira\n", 
        "title": "Desafios e vantagens do trabalho remoto freelancer Python"
      }
    }
  ]
}
