{
  "0.0.1": [
    {
      "02": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Paola Katherine", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }, 
      "13": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Comunidade PythonMG", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Encerramento"
      }, 
      "01": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Comunidade PythonMG", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Abertura"
      }, 
      "07": {
        "speaker": {
          "info": "", 
          "photo": "https://graph.facebook.com/v2.4/2156035871289568/picture?type=square&height=600&width=600&return_ssl_resources=1", 
          "name": "Daniela Petruzalek", 
          "social": [
            {
              "email": "daniela.petruzalek@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nUma introdução ao mundo de Big Data com Apache Spark contextualizada dentro do ambiente da Globo.com. Aborda desde a definição de Big Data, a mudança de paradigma de programação para viabilizar a computação paralela, os diferenciais tecnológicos do Spark e as suas aplicações práticas na Globo.com. Finalizamos com uma breve demo do pyspark shell.\n", 
        "title": "Big Data com Apache Spark na Globo.com"
      }, 
      "04": {
        "speaker": {
          "info": "", 
          "photo": "https://www.gravatar.com/avatar/b6afc45ba08adb4f42597eee82eab137?s=200&d=mm", 
          "name": "Ryllari Santana", 
          "social": [
            {
              "github": "https://github.com/ryllari", 
              "facebook": "https://facebook.com/ryllarezita", 
              "email": "ryllarimarques@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\n[Iniciante]Todo bom programador já passou por uma fase na vida em que a POG (Programação Orientada a Gambiarra) foi sua melhor amiga. Junto com ela (ou até mesmo sem ela!), encontram-se erros comuns e alguns erros absurdos que são cometidos com frequência e que, na maioria das vezes passam despercebidos até mesmo por programadores experientes. Nesta palestra, irei mostrar algumas dicas do que não fazer quando estiver programando em Python, utilizando como exemplos alguns códigos e erros que programadores (do Padawan ao Mestre Yoda) cometem sem nem sentir o peso.13(-10) reasons why você precisa assistir esta palestra:1. \"O inteligente aprende com os seus erros, o sábio aprende com os erros dos outros.\"2. Conhecer os erros ajuda a evitá-los.3. Python é bom demais pra ser codado errado.\n", 
        "title": "Como NÃO programar em Python: crimes dolosos e com agravante"
      }, 
      "05": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars1.githubusercontent.com/u/458654?v=3", 
          "name": "Bruno Rocha", 
          "social": [
            {
              "email": "rochacbruno@gmail.com"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nO ecossistema do Python é sustentado por alguns pilares que são- comunidade,  - material teórico, - ferramentas, - bibliotecas, - PSF - e a própria linguagem.Nesta palestra eu gostaria de fazer uma reflexão a respeito de cada um desses pilares do ecossistemaquais são as prioridades e em termos de qualidade quais são as vulnerabilidades de cada um deles.Mencionarei a importãncia de todos mas focarei na qualidade do ecossistema de bibliotecas, ferramentas e material teórico.A reflexão será em torno de responder algumas questões:- Como manter a qualidade das bibliotecas publicadas no PyPI?- Quais as maiores vulnerabilidades e como podemos ajudar a evitar os riscos?- A importância de material teórico de qualidade (gerado pela comunidade)- Podemos confiar em tudo que está disponivel no PyPI?- As abordagens de ensino e documentação do ecossitema são seguras, inclusivas e de fácil assimilação?- O que podemos fazer para ajudar a resolver os problemas identificados?Apresentarei alguns casos reais e exemplos de problemas encontrados e questões de segurança envolvendo principalmente o PyPI \n", 
        "title": "A Qualidade do Ecossistema Python - e o que podemos fazer para mantê-la"
      }, 
      "08": {
        "speaker": {
          "info": "Eterno estudante de ciência da computação sou um dos responsáveis pelo PyCursos e Python para Zumbis (MOOC de ensino de Python com mais de 30 mill inscrições). Tenho interesse em: Desenvolvimento de Software, Python, Análise de Dados, Inteligência Artificial, Engenharia de Avaliações, Design e Minimalismo.Interesses em: Desenvolvimento de Software, Python, Análise de Dados, Inteligência Artificial, Engenharia de Avaliações, Design e Minimalismo.", 
          "photo": "https://avatars0.githubusercontent.com/u/223948?v=3", 
          "name": "Gileno Filho", 
          "social": [
            {
              "globe": "http://www.gilenofilho.com.br/", 
              "github": "https://github.com/gileno", 
              "facebook": "https://facebook.com/gilenofilho", 
              "email": "contato@gilenofilho.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nJá tentou acessar uma página através de um script Python e teve problemas porque a página usava algum framework javascript como Angular, React...?Nessa palestra vou mostrar como criar um web crawler que consiga acessar essas páginas dinâmicas simulando um navegador com Scrapy e Selenium.\n", 
        "title": "Criando Web Crawlers com Scrapy e Selenium para páginas com Javascript"
      }, 
      "09": {
        "speaker": {
          "info": "", 
          "photo": "https://avatars0.githubusercontent.com/u/1480558?v=4", 
          "name": "Bianca Rosa", 
          "social": [
            {
              "email": "me@biancarosa.com.br"
            }
          ]
        }, 
        "type": "talk", 
        "description": "\nA idéia dessa palestra é passar brevemente pela introdução à Redes Neurais e mostrar a implementação de uma rede neural, mostrando como utilizar Python e Scikit para criar redes supervisionadas e não-supervisionadas.Nível: IntermediárioTópicos:- Redes Neurais?   - Introdução   - Redes Supervisionadas   - Redes Não-Supervisionadas   - Aplicações- Show me the code!\n", 
        "title": "Redes Neurais com Python e Scikit"
      }, 
      "12": {
        "speaker": {
          "info": "", 
          "photo": "", 
          "name": "Manuel Kaufmann", 
          "social": []
        }, 
        "type": "talk", 
        "description": "", 
        "title": "Keynote"
      }
    }
  ]
}
